# Taller

En este taller trabajará con dos dataset  'title.csv' y 'cast.csv'. El archivo 'title.csv' contiene la lista de películas con el año de estreno; mientras que el archivo 'cast.csv' tiene cinco columnas que almacenan el título de la película, año de estreno, elenco de estrellas, tipo (actor / actriz), personajes y calificaciones de los actores, como se muestra a continuación,

In [ ]:
#En esta celda se van a dejar  las librerías que usará a lo largo del taller
import json
import requests
from bs4 import BeautifulSoup
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
# Cargas los dos datasets
with open('/content/drive/MyDrive/Data_Science/cast.csv') as f:
  cast=pd.read_csv(f,delimiter=',')

In [ ]:
with open('/content/drive/MyDrive/Data_Science/titles.csv') as f:
  titles=pd.read_csv(f,delimiter=',')

In [ ]:
#Despliegue una muestra del dataset title (head, tail, sample)
titles.head

<bound method NDFrame.head of                                         title  year
0                                      Mahler  1974
1                Ogon, voda i... mednye truby  1968
2       Ana Nojoom bent alasherah wamotalagah  2014
3                           Malu de Bicicleta  2010
4                  Nazareno Apostol: Boy Ahas  1989
...                                       ...   ...
230402                          El lobo negro  1981
230403                   Komu na Rusi zhit...  1989
230404                               Senotaji  2013
230405                      The Leopard Woman  1920
230406                     Mio caro assassino  1972

[230407 rows x 2 columns]>

In [ ]:
titles.tail

<bound method NDFrame.tail of                                         title  year
0                                      Mahler  1974
1                Ogon, voda i... mednye truby  1968
2       Ana Nojoom bent alasherah wamotalagah  2014
3                           Malu de Bicicleta  2010
4                  Nazareno Apostol: Boy Ahas  1989
...                                       ...   ...
230402                          El lobo negro  1981
230403                   Komu na Rusi zhit...  1989
230404                               Senotaji  2013
230405                      The Leopard Woman  1920
230406                     Mio caro assassino  1972

[230407 rows x 2 columns]>

In [ ]:
titles.sample

<bound method NDFrame.sample of                                         title  year
0                                      Mahler  1974
1                Ogon, voda i... mednye truby  1968
2       Ana Nojoom bent alasherah wamotalagah  2014
3                           Malu de Bicicleta  2010
4                  Nazareno Apostol: Boy Ahas  1989
...                                       ...   ...
230402                          El lobo negro  1981
230403                   Komu na Rusi zhit...  1989
230404                               Senotaji  2013
230405                      The Leopard Woman  1920
230406                     Mio caro assassino  1972

[230407 rows x 2 columns]>

In [ ]:
#Despliegue una muestra del dataset cast  (head, tail, sample)
cast.sample

<bound method NDFrame.sample of                                     title  year  ...                character     n
0                          Closet Monster  2015  ...                  Buffy 4  31.0
1                         Suuri illusioni  1985  ...                   Guests  22.0
2                     Battle of the Sexes  2017  ...          Bobby Riggs Fan  10.0
3                    Secret in Their Eyes  2015  ...          2002 Dodger Fan   NaN
4                              Steve Jobs  2015  ...  1988 Opera House Patron   NaN
...                                   ...   ...  ...                      ...   ...
3564645                    Stuttur Frakki  1993  ...               Flugfreyja  24.0
3564646                           Foxtrot  1988  ...                     D?ra  24.0
3564647  Niceland (Population. 1.000.002)  2004  ...             Woman in Bus  26.0
3564648                      U.S.S.S.S...  2003  ...   Afgr.dama ? bens?nst??  17.0
3564649                 Bye Bye Blue Bird  1999  ...        Pensionatv?rtinde   NaN

[3564650 rows x 6 columns]>

In [ ]:
cast.tail

<bound method NDFrame.tail of                                     title  year  ...                character     n
0                          Closet Monster  2015  ...                  Buffy 4  31.0
1                         Suuri illusioni  1985  ...                   Guests  22.0
2                     Battle of the Sexes  2017  ...          Bobby Riggs Fan  10.0
3                    Secret in Their Eyes  2015  ...          2002 Dodger Fan   NaN
4                              Steve Jobs  2015  ...  1988 Opera House Patron   NaN
...                                   ...   ...  ...                      ...   ...
3564645                    Stuttur Frakki  1993  ...               Flugfreyja  24.0
3564646                           Foxtrot  1988  ...                     D?ra  24.0
3564647  Niceland (Population. 1.000.002)  2004  ...             Woman in Bus  26.0
3564648                      U.S.S.S.S...  2003  ...   Afgr.dama ? bens?nst??  17.0
3564649                 Bye Bye Blue Bird  1999  ...        Pensionatv?rtinde   NaN

[3564650 rows x 6 columns]>

In [ ]:
cast.sample

<bound method NDFrame.sample of                                     title  year  ...                character     n
0                          Closet Monster  2015  ...                  Buffy 4  31.0
1                         Suuri illusioni  1985  ...                   Guests  22.0
2                     Battle of the Sexes  2017  ...          Bobby Riggs Fan  10.0
3                    Secret in Their Eyes  2015  ...          2002 Dodger Fan   NaN
4                              Steve Jobs  2015  ...  1988 Opera House Patron   NaN
...                                   ...   ...  ...                      ...   ...
3564645                    Stuttur Frakki  1993  ...               Flugfreyja  24.0
3564646                           Foxtrot  1988  ...                     D?ra  24.0
3564647  Niceland (Population. 1.000.002)  2004  ...             Woman in Bus  26.0
3564648                      U.S.S.S.S...  2003  ...   Afgr.dama ? bens?nst??  17.0
3564649                 Bye Bye Blue Bird  1999  ...        Pensionatv?rtinde   NaN

[3564650 rows x 6 columns]>

In [ ]:
#Cuantos nomrbes de peliculas hay en title y cuantos son distintos
titles.count()

title    230407
year     230407
dtype: int64

In [ ]:
df.diff()

In [ ]:
titles

                                        title  year
0                                      Mahler  1974
1                Ogon, voda i... mednye truby  1968
2       Ana Nojoom bent alasherah wamotalagah  2014
3                           Malu de Bicicleta  2010
4                  Nazareno Apostol: Boy Ahas  1989
...                                       ...   ...
230402                          El lobo negro  1981
230403                   Komu na Rusi zhit...  1989
230404                               Senotaji  2013
230405                      The Leopard Woman  1920
230406                     Mio caro assassino  1972

[230407 rows x 2 columns]

In [ ]:
#Cuantas peliculas por año en el dataset titles y cuantas en el dataset cast
titles.count()

title    230407
year     230407
dtype: int64

In [ ]:
# cuantas peliculas tienen por nombre "Hamlet"
titles[(titles.title == 'Hamlet')]

         title  year
10292   Hamlet  2011
21526   Hamlet  1954
26003   Hamlet  1976
27654   Hamlet  1921
30756   Hamlet  1996
44266   Hamlet  1913
47385   Hamlet  1964
50848   Hamlet  1948
109921  Hamlet  1911
121876  Hamlet  2014
135830  Hamlet  1990
137015  Hamlet  2009
153930  Hamlet  2000
155754  Hamlet  2016
158256  Hamlet  1969
161520  Hamlet  1910
165195  Hamlet  1973
190924  Hamlet  1987
191282  Hamlet  2015

In [ ]:
#Cuantas peliculas son de nombre "Carmen" y son de antes de 1950
titles[(titles.title == 'Carmen') & (titles.year <= 1950)]

         title  year
40984   Carmen  1926
46836   Carmen  1941
47609   Carmen  1944
66817   Carmen  1932
68578   Carmen  1921
77049   Carmen  1943
93538   Carmen  1918
120865  Carmen  1915

In [ ]:
# Titulos mas comunes en la historia filmografica

In [ ]:
# Cual fue la primer pelicula hecha titulada "Romeo and Juliet"
titles[(titles.title == 'Romeo and Juliet')]

                   title  year
16975   Romeo and Juliet  2014
82622   Romeo and Juliet  1936
87037   Romeo and Juliet  1954
124702  Romeo and Juliet  1916
144796  Romeo and Juliet  2013
147308  Romeo and Juliet  1947
185337  Romeo and Juliet  1968
196039  Romeo and Juliet  1966

In [ ]:
# Listar todas las peliculas que contengan la palabra "Exorcist" 
# ordenadas de la mas antigua a la mas reciente

In [ ]:
# Cuantas peliculas fueron hechas en el año 1950?
titles[(titles.year == 1950)]

                       title  year
68         Emei fei jian xia  1950
176                  Hua jie  1950
223                 Spy Hunt  1950
376                  Sarumba  1950
522             Onu affettim  1950
...                      ...   ...
230060  Deadly Is the Female  1950
230125    Magkumpareng Putik  1950
230136   Kanske en gentleman  1950
230227    Dick Barton at Bay  1950
230278        Alakh Niranjan  1950

[1081 rows x 2 columns]

In [ ]:
# Cuantas peliculas fueron despues del año 1970?
titles[(titles.year >= 1970)]

                                        title  year
0                                      Mahler  1974
2       Ana Nojoom bent alasherah wamotalagah  2014
3                           Malu de Bicicleta  2010
4                  Nazareno Apostol: Boy Ahas  1989
5                          Ya ba yu xin niang  1971
...                                       ...   ...
230400                              Yeohoshin  1981
230402                          El lobo negro  1981
230403                   Komu na Rusi zhit...  1989
230404                               Senotaji  2013
230406                     Mio caro assassino  1972

[166665 rows x 2 columns]

In [ ]:
# Cuantas peliculas fueron hechas de 1970 a 1979
titles[titles["year"].between(1970,1979)]

                                                    title  year
0                                                  Mahler  1974
5                                      Ya ba yu xin niang  1971
21      4 caporali e 1/2 e un colonnello tutto d'un pezzo  1973
34                   Ramdenime interviu pirad sakitkhebze  1977
38                                Coronel Delmiro Gouveia  1978
...                                                   ...   ...
230345                                Aggimeobshi baehari  1972
230369                                          Fish Hawk  1979
230384                 Posledneye delo komissara Berlakha  1972
230388                                             Sillik  1970
230406                                 Mio caro assassino  1972

[18508 rows x 2 columns]

Ahora se trabajara con el dataset de cast, importante tambien tener en cuneta que e sun dataset que se tendra que limpiar con el paso de las clases y dejarlo lo mas optimo posible

In [ ]:
cast

                                    title  year  ...                character     n
0                          Closet Monster  2015  ...                  Buffy 4  31.0
1                         Suuri illusioni  1985  ...                   Guests  22.0
2                     Battle of the Sexes  2017  ...          Bobby Riggs Fan  10.0
3                    Secret in Their Eyes  2015  ...          2002 Dodger Fan   NaN
4                              Steve Jobs  2015  ...  1988 Opera House Patron   NaN
...                                   ...   ...  ...                      ...   ...
3564645                    Stuttur Frakki  1993  ...               Flugfreyja  24.0
3564646                           Foxtrot  1988  ...                     D?ra  24.0
3564647  Niceland (Population. 1.000.002)  2004  ...             Woman in Bus  26.0
3564648                      U.S.S.S.S...  2003  ...   Afgr.dama ? bens?nst??  17.0
3564649                 Bye Bye Blue Bird  1999  ...        Pensionatv?rtinde   NaN

[3564650 rows x 6 columns]

In [ ]:
# Cuantos roles o papeles hubo en la pelicula "The Godfather"

len(cast.loc[cast.titles == "The Godfather"])

AttributeError: ignored